export const LOGO_TEXT = "text-bn.svg";
export const APP_TITLE = "আমিরাবাদ জি.কে. উচ্চ বিদ্যালয়";
export const WELCOME_TEXT = "স্বাগতম";
export const HOME = {
  welcome: "স্বাগতম",
  welcomeText:
    "অর্থহীন লেখা যার মাঝে আছে অনেক কিছু। হ্যাঁ, এই লেখার মাঝেই আছে অনেক কিছু। যদি তুমি মনে করো, এটা তোমার কাজে লাগবে, তাহলে তা লাগবে কাজে। নিজের ভাষায় লেখা দেখতে অভ্যস্ত হও। মনে রাখবে লেখা অর্থহীন হয়, যখন তুমি তাকে অর্থহীন মনে করো; আর লেখা অর্থবোধকতা তৈরি করে, যখন তুমি তাতে অর্থ ঢালো। যেকোনো লেখাই তোমার কাছে অর্থবোধকতা তৈরি করতে পারে, যদি তুমি সেখানে অর্থদ্যোতনা দেখতে পাও। …ছিদ্রান্বেষণ? না, তা হবে কেন?\n\nযে কথাকে কাজে লাগাতে চাও, তাকে কাজে লাগানোর কথা চিন্তা করার আগে ভাবো, তুমি কি সেই কথার জাদুতে আচ্ছন্ন হয়ে গেছ কিনা। তুমি যদি নিশ্চিত হও যে, তুমি কোনো মোহাচ্ছাদিত আবহে আবিষ্ট হয়ে অন্যের শেখানো বুলি আত্মস্থ করছো না, তাহলে তুমি নির্ভয়ে, নিশ্চিন্তে অগ্রসর হও। তুমি সেই কথাকে জানো, বুঝো, আত্মস্থ করো; মনে রাখবে, যা অনুসরণ করতে চলেছো, তা আগে অনুধাবন করা জরুরি; এখানে কিংকর্তব্যবিমূঢ় হবার কোনো সুযোগ নেই।",
  headSirName: "জনাব আবদুল রহিম",
  headSirTitle: "প্রধান শিক্ষক",
};
export const FOOTER = {
  contact: {
    title: "যোগাযোগ করুন",
    address: {
      label: "যোগাযোগ করুন",
      value: "দামোদরদী, বিষ্ণুপুর, চাঁদপুর সদর - 3602",
    },
    email: {
      label: "ইমেইল করুন",
      value: "info@amirabad.g.k.highschol.edu.bd",
    },
    mobile: {
      label: "কল করুন",
      value: "+৮৮০১২৩৪৫৬৭৮৯০",
    },
    social: {
      label: "আমাদের সাথে থাকুন",
    },
  },
  links: {
    title: "গুরুত্বপূর্ণ লিঙ্ক সমূহ",
  },
  copyRight: `কপিরাইট © ${new Date()
    .getFullYear()
    .toLocaleString("bn")
    .replace(",", "")} ${APP_TITLE}। সমস্ত অধিকার সংরক্ষিত।`,
};
export const ABOUT_PAGE = {
  title: "সম্পর্কিত",
  description:
    "অর্থহীন লেখা যার মাঝে আছে অনেক কিছু। হ্যাঁ, এই লেখার মাঝেই আছে অনেক কিছু। যদি তুমি মনে করো, এটা তোমার কাজে লাগবে, তাহলে তা লাগবে কাজে। নিজের ভাষায় লেখা দেখতে অভ্যস্ত হও। মনে রাখবে লেখা অর্থহীন হয়, যখন তুমি তাকে অর্থহীন মনে করো; আর লেখা অর্থবোধকতা তৈরি করে, যখন তুমি তাতে অর্থ ঢালো। যেকোনো লেখাই তোমার কাছে অর্থবোধকতা তৈরি করতে পারে, যদি তুমি সেখানে অর্থদ্যোতনা দেখতে পাও। …ছিদ্রান্বেষণ? না, তা হবে কেন? যে কথাকে কাজে লাগাতে চাও, তাকে কাজে লাগানোর কথা চিন্তা করার আগে ভাবো, তুমি কি সেই কথার জাদুতে আচ্ছন্ন হয়ে গেছ কিনা। তুমি যদি নিশ্চিত হও যে, তুমি কোনো মোহাচ্ছাদিত আবহে আবিষ্ট হয়ে অন্যের শেখানো বুলি আত্মস্থ করছো না, তাহলে তুমি নির্ভয়ে, নিশ্চিন্তে অগ্রসর হও। তুমি সেই কথাকে জানো, বুঝো, আত্মস্থ করো; মনে রাখবে, যা অনুসরণ করতে চলেছো, তা আগে অনুধাবন করা জরুরি; এখানে কিংকর্তব্যবিমূঢ় হবার কোনো সুযোগ নেই।",
  historyTitle: "ইতিহাস",
  historyDescription:
    "অংশ অংশভাক আঁইশ ইঁচড়েপাকা ঈক্ষণ ঈদৃক অংশভাগী জওয়ান অংশাঙ্কিত ইউক্যালিপটাস অংশাবতার হালহদিশ পিতৃতর্পণ টকানো ঈক্ষিত জগজ্জন তকতনামা আঁকুবাঁকু পঁইছা জগঝপ্প পঁহুছা দ্রাবিড়ী আঁকুড়ি ঈদৃক জগদম্বা টঙ্ক অংশিন্‌ জগদ্গৌরী আঁচা তকরার তিলপিটালি গজ-দাঁত অংশু ঈপ্সনীয় পইতা শংকরাভরণ হংসগমন পকড় অংশুধর ঈপ্সু ঈর্ষী জগদ্ধাত্রী আঁজনাই তক্তি শংসনপত্র হংসারূঢ়া দংশল তক্ষক অংশুমান ইকেবানা জগদ্বন্ধু ঈশিত্ব ইক্ষ্বাকু আঁজি অংসকুট টঙ্কক তক্ষণাস্ত্র পকোড়া দংষ্ট্রা শকটিকা হকচকা বঁইচি শকল বংশাঙ্কুর তক্ষণী আঁটকুড় ঈশ্বরদ্বেষী টঙ্কার পক্ববিম্বাধরোষ্ঠী শকারবকার হট্টবিলাসিনী বংশাবতংস ইঙ্গবঙ্গ পক্ষচ্ছেদ দংষ্ট্রাল হঠযোগ অষ্টনাগ পক্ষপাতিতা টনটনানি ঈশ্বরাজ্ঞা বউল",
  locationTitle: "অবস্থান",
  routes: {
    teachers: "আমাদের শিক্ষকবৃন্দ",
    alumni: "আমাদের গর্ব",
  },
};

export const ROUTES = {
  home: "হোম",
  aboutUs: "আমাদের সম্পর্কে",
  teachers: "শিক্ষকবৃন্দ",
  alumni: "প্রাক্তন শিক্ষার্থীবৃন্দ",
  academic: "একাডেমিক",
  routine: "রুটিন",
  syllabus: "সিলেবাস",
  coCurricularActivities: "সহ - পাঠক্রম সংক্রান্ত কার্যক্রম",
  guidelines: "নির্দেশিকা-সমূহ",
  noticeBoard: "নোটিসবোর্ড",
  gallery: "গ্যালারি",
};
